Repository: pfrankov/vibe-scribe
Catalog: VibeScribe/Resources/*.lproj/Localizable.strings
Languages: de, ru, zh_hans

source: Settings
de: Einstellungen
ru: Настройки
zh_hans: 设置

# settings.ellipsis
source: Settings...
de: Einstellungen...
ru: Настройки...
zh_hans: 设置...

source: Open
de: Öffnen
ru: Открыть
zh_hans: 打开

source: Start Recording
de: Aufnahme starten
ru: Начать запись
zh_hans: 开始录音

source: Quit
de: Beenden
ru: Завершить
zh_hans: 退出

source: Microphone Permission Required
de: Mikrofonzugriff erforderlich
ru: Требуется доступ к микрофону
zh_hans: 需要麦克风权限

source: VibeScribe needs microphone access to record audio. Please grant permission in System Preferences > Security & Privacy > Microphone.
de: VibeScribe benötigt Zugriff auf das Mikrofon, um Audio aufzunehmen. Bitte gewähren Sie den Zugriff in den Systemeinstellungen > Sicherheit & Datenschutz > Mikrofon.
ru: VibeScribe нужен доступ к микрофону для записи звука. Пожалуйста, предоставьте разрешение в Системных настройках > Конфиденциальность и безопасность > Микрофон.
zh_hans: VibeScribe 需要麦克风权限来录制音频。请在“系统设置”>“隐私与安全性”>“麦克风”中授予权限。

source: Open System Preferences
de: Systemeinstellungen öffnen
ru: Открыть Системные настройки
zh_hans: 打开系统设置

source: Cancel
de: Abbrechen
ru: Отмена
zh_hans: 取消

source: Import
de: Importieren
ru: Импорт
zh_hans: 导入

source: Select audio you'd like VibeScribe to transcribe and summarize.
de: Wählen Sie Audio aus, das VibeScribe transkribieren und zusammenfassen soll.
ru: Выберите аудио, которое VibeScribe должен транскрибировать и кратко изложить.
zh_hans: 选择您希望 VibeScribe 转录和总结的音频。

source: Start a new recording
de: Neue Aufnahme starten
ru: Начать новую запись
zh_hans: 开始新录音

source: Opens the floating overlay to capture mic and system audio.
de: Öffnet das schwebende Overlay zur Aufnahme von Mikrofon und Systemaudio.
ru: Открывает плавающее окно для записи с микрофона и системного звука.
zh_hans: 打开悬浮窗口以捕获麦克风和系统音频。

source: All Recordings
de: Alle Aufnahmen
ru: Все записи
zh_hans: 所有录音

source: This Week
de: Diese Woche
ru: На этой неделе
zh_hans: 本周

source: Last Week
de: Letzte Woche
ru: На прошлой неделе
zh_hans: 上周

# in.arg1
source: In %@
ru: В %@
zh_hans: 在 %@

source: Select a recording from the list
de: Wählen Sie eine Aufnahme aus der Liste
ru: Выберите запись из списка
zh_hans: 从列表中选择一个录音

source: New Recording
de: Neue Aufnahme
ru: Новая запись
zh_hans: 新录音

source: No recordings yet
de: Noch keine Aufnahmen
ru: Записей пока нет
zh_hans: 暂无录音

source: Start a capture or import a file from the panel on the right.
de: Starten Sie eine Aufnahme oder importieren Sie eine Datei über das rechte Panel.
ru: Начните запись или импортируйте файл через панель справа.
zh_hans: 开始录制或从右侧面板导入文件。

source: Import Error
de: Importfehler
ru: Ошибка импорта
zh_hans: 导入错误

source: Check file format and try again
de: Überprüfen Sie das Dateiformat und versuchen Sie es erneut
ru: Проверьте формат файла и попробуйте снова
zh_hans: 检查文件格式并重试

source: Drop Audio Files Here
de: Audiodateien hier ablegen
ru: Перетащите аудиофайлы сюда
zh_hans: 将音频文件拖放到此处

source: Supported formats: MP3, WAV, M4A, AAC, OGG, FLAC
de: Unterstützte Formate: MP3, WAV, M4A, AAC, OGG, FLAC
ru: Поддерживаемые форматы: MP3, WAV, M4A, AAC, OGG, FLAC
zh_hans: 支持的格式：MP3, WAV, M4A, AAC, OGG, FLAC

source: Welcome to VibeScribe
de: Willkommen bei VibeScribe
ru: Добро пожаловать в VibeScribe
zh_hans: 欢迎使用 VibeScribe

source: Record or import conversations, keep processing on your own Whisper-compatible server, and read the AI summary right away.
de: Nehmen Sie Gespräche auf oder importieren Sie sie, verarbeiten Sie sie auf Ihrem eigenen Whisper-kompatiblen Server und lesen Sie sofort die KI-Zusammenfassung.
ru: Записывайте или импортируйте разговоры, обрабатывайте их на собственном Whisper-совместимом сервере и сразу читайте ИИ-сводку.
zh_hans: 录制或导入对话，在您自己的 Whisper 兼容服务器上处理，并立即阅读 AI 摘要。

source: Pick your first step
de: Wählen Sie Ihren ersten Schritt
ru: Выберите первый шаг
zh_hans: 选择您的第一步

source: Install WhisperServer
de: WhisperServer installieren
ru: Установить WhisperServer
zh_hans: 安装 WhisperServer

source: Run WhisperServer locally or on your own host to keep conversations private.
de: Führen Sie WhisperServer lokal oder auf Ihrem eigenen Host aus, um Gespräche privat zu halten.
ru: Запустите WhisperServer локально или на собственном хосте, чтобы сохранить конфиденциальность разговоров.
zh_hans: 在本地或您自己的主机上运行 WhisperServer 以保持对话私密。

source: Connect your transcription and summary services
de: Verbinden Sie Ihre Transkriptions- und Zusammenfassungsdienste
ru: Подключите сервисы транскрипции и суммаризации
zh_hans: 连接您的转录和摘要服务

source: Add your Whisper-compatible audio endpoint and chat model so VibeScribe can process automatically.
de: Fügen Sie Ihren Whisper-kompatiblen Audio-Endpunkt und das Chat-Modell hinzu, damit VibeScribe automatisch verarbeiten kann.
ru: Добавьте Whisper-совместимый аудио-эндпоинт и чат-модель, чтобы VibeScribe мог обрабатывать данные автоматически.
zh_hans: 添加您的 Whisper 兼容音频端点和聊天模型，以便 VibeScribe 自动处理。

source: The recordings, transcriptions, and summaries stay on your Mac and only you determine what to do with them.
de: Die Aufnahmen, Transkriptionen und Zusammenfassungen bleiben auf Ihrem Mac und nur Sie bestimmen, was damit geschieht.
ru: Записи, транскрипции и сводки остаются на вашем Mac, и только вы решаете, что с ними делать.
zh_hans: 录音、转录和摘要保留在您的 Mac 上，只有您决定如何处理它们。

# start.recording.2
source: Start recording
de: Aufnahme starten
ru: Начать запись
zh_hans: 开始录音

source: Import audio file
de: Audiodatei importieren
ru: Импортировать аудиофайл
zh_hans: 导入音频文件

source: Reset filter
de: Filter zurücksetzen
ru: Сбросить фильтр
zh_hans: 重置过滤器

# importing.arg1.arg2.arg3
source: Importing %d/%d: %@
de: Importiere %d/%d: %@
ru: Импорт %d/%d: %@
zh_hans: 正在导入 %d/%d: %@

# converting.arg1.arg2.arg3
source: Converting %d/%d: %@
de: Konvertiere %d/%d: %@
ru: Конвертация %d/%d: %@
zh_hans: 正在转换 %d/%d: %@

# saving.arg1.arg2.arg3
source: Saving %d/%d: %@
de: Speichere %d/%d: %@
ru: Сохранение %d/%d: %@
zh_hans: 正在保存 %d/%d: %@

# recording.arg1
source: Recording %@
de: Aufnahme %@
ru: Запись %@
zh_hans: 录音 %@

source: Recording
de: Aufnahme
ru: Запись
zh_hans: 录音

source: Audio Exported
de: Audio exportiert
ru: Аудио экспортировано
zh_hans: 音频已导出

# recording.saved.to.arg1
source: Recording saved to %@
de: Aufnahme gespeichert unter %@
ru: Запись сохранена в %@
zh_hans: 录音已保存至 %@

source: Export Failed
de: Export fehlgeschlagen
ru: Ошибка экспорта
zh_hans: 导出失败

source: Export Unavailable
de: Export nicht verfügbar
ru: Экспорт недоступен
zh_hans: 导出不可用

source: The original audio file could not be located.
de: Die Original-Audiodatei konnte nicht gefunden werden.
ru: Оригинальный аудиофайл не найден.
zh_hans: 无法找到原始音频文件。

source: Save Recording
de: Aufnahme speichern
ru: Сохранить запись
zh_hans: 保存录音

source: OK
ru: ОК
zh_hans: 确定

source: Delete Recording?
de: Aufnahme löschen?
ru: Удалить запись?
zh_hans: 删除录音？

source: This will permanently remove the recording, transcription, and summary. This action cannot be undone.
de: Dies wird die Aufnahme, Transkription und Zusammenfassung dauerhaft entfernen. Diese Aktion kann nicht rückgängig gemacht werden.
ru: Это безвозвратно удалит запись, транскрипцию и сводку. Это действие нельзя отменить.
zh_hans: 这将永久删除录音、转录和摘要。此操作无法撤销。

source: Delete
de: Löschen
ru: Удалить
zh_hans: 删除

source: Close
de: Schließen
ru: Закрыть
zh_hans: 关闭

source: Resume
de: Fortsetzen
ru: Продолжить
zh_hans: 恢复

source: Save
de: Speichern
ru: Сохранить
zh_hans: 保存

source: Stop
de: Stopp
ru: Стоп
zh_hans: 停止

# preparing.ellipsis
source: Preparing...
de: Vorbereiten...
ru: Подготовка...
zh_hans: 准备中...

source: Error
de: Fehler
ru: Ошибка
zh_hans: 错误

source: Microphone + System Audio
de: Mikrofon + Systemaudio
ru: Микрофон + Системный звук
zh_hans: 麦克风 + 系统音频

source: Microphone Only
de: Nur Mikrofon
ru: Только микрофон
zh_hans: 仅麦克风

source: Microphone source
de: Mikrofonquelle
ru: Источник микрофона
zh_hans: 麦克风来源

source: System audio is captured when available
de: Systemaudio wird aufgenommen, wenn verfügbar
ru: Системный звук записывается при наличии
zh_hans: 可用时捕获系统音频

source: Audio source indicators: microphone and system audio
de: Audioquellen-Indikatoren: Mikrofon und Systemaudio
ru: Индикаторы источника звука: микрофон и системный звук
zh_hans: 音频源指示器：麦克风和系统音频

source: Discard recording?
de: Aufnahme verwerfen?
ru: Отменить запись?
zh_hans: 放弃录音？

source: This will stop and delete the current recording.
de: Dies wird die aktuelle Aufnahme stoppen und löschen.
ru: Это остановит и удалит текущую запись.
zh_hans: 这将停止并删除当前录音。

source: Discard
de: Verwerfen
ru: Отменить
zh_hans: 放弃

source: Name
ru: Название
zh_hans: 名称

source: Transcription
de: Transkription
ru: Транскрипция
zh_hans: 转录

source: Summary
de: Zusammenfassung
ru: Сводка
zh_hans: 摘要

source: Transcribe
de: Transkribieren
ru: Транскрибировать
zh_hans: 转录

source: Summarize
de: Zusammenfassen
ru: Суммировать
zh_hans: 总结

# start.typing.transcription.ellipsis
source: Start typing transcription...
de: Transkription eingeben...
ru: Начните печатать транскрипцию...
zh_hans: 开始输入转录...

source: No summary available yet.
de: Noch keine Zusammenfassung verfügbar.
ru: Сводка пока недоступна.
zh_hans: 暂无摘要。

source: Transcription resulted in empty text. Try again with a different model or check audio quality.
de: Transkription ergab leeren Text. Versuchen Sie es mit einem anderen Modell oder überprüfen Sie die Audioqualität.
ru: Транскрипция вернула пустой текст. Попробуйте другую модель или проверьте качество звука.
zh_hans: 转录结果为空。请尝试使用不同的模型或检查音频质量。

# transcription.processing.ellipsis.check.back.later
source: Transcription processing... Check back later.
de: Transkription wird verarbeitet... Schauen Sie später wieder vorbei.
ru: Идет транскрипция... Загляните позже.
zh_hans: 转录处理中... 请稍后再查看。

source: Transcription not available yet.
de: Transkription noch nicht verfügbar.
ru: Транскрипция пока недоступна.
zh_hans: 转录暂不可用。

# loading.languages.ellipsis
source: Loading languages...
de: Lade Sprachen...
ru: Загрузка языков...
zh_hans: 正在加载语言...

source: Choose language
de: Sprache wählen
ru: Выберите язык
zh_hans: 选择语言

source: Automatic
de: Automatisch
ru: Автоматически
zh_hans: 自动

source: Select transcription model
de: Transkriptionsmodell wählen
ru: Выберите модель транскрипции
zh_hans: 选择转录模型

source: Choose model
de: Modell wählen
ru: Выберите модель
zh_hans: 选择模型

source: Select summary model
de: Zusammenfassungsmodell wählen
ru: Выберите модель суммаризации
zh_hans: 选择摘要模型

source: Download Audio
de: Audio herunterladen
ru: Скачать аудио
zh_hans: 下载音频

source: Rename
de: Umbenennen
ru: Переименовать
zh_hans: 重命名

source: Remove tag
de: Tag entfernen
ru: Удалить тег
zh_hans: 移除标签

# filter.by.arg1
source: Filter by %@
de: Filtern nach %@
ru: Фильтр по %@
zh_hans: 按 %@ 过滤

# filter.recordings.by.arg1
source: Filter recordings by %@
de: Aufnahmen filtern nach %@
ru: Фильтровать записи по %@
zh_hans: 按 %@ 过滤录音

# tag.arg1
source: Tag: %@
ru: Тег: %@
zh_hans: 标签: %@

source: Add tag
de: Tag hinzufügen
ru: Добавить тег
zh_hans: 添加标签

source: Add a tag
de: Tag hinzufügen
ru: Добавить тег
zh_hans: 添加标签

source: Copied!
de: Kopiert!
ru: Скопировано!
zh_hans: 已复制！

source: Copy to clipboard
de: In die Zwischenablage kopieren
ru: Скопировать в буфер обмена
zh_hans: 复制到剪贴板

source: Playback Speed
de: Wiedergabegeschwindigkeit
ru: Скорость воспроизведения
zh_hans: 播放速度

source: Skip back 10 seconds
de: 10 Sekunden zurück
ru: Назад на 10 секунд
zh_hans: 后退 10 秒

source: Skip forward 10 seconds
de: 10 Sekunden vor
ru: Вперед на 10 секунд
zh_hans: 快进 10 秒

source: Pause
ru: Пауза
zh_hans: 暂停

source: Play
de: Abspielen
ru: Воспроизвести
zh_hans: 播放

source: Ready
de: Bereit
ru: Готово
zh_hans: 就绪

# transcribing.ellipsis
source: Transcribing...
de: Transkribiere...
ru: Транскрибирование...
zh_hans: 转录中...

# streaming.transcription.ellipsis
source: Streaming transcription...
de: Streame Transkription...
ru: Потоковая транскрипция...
zh_hans: 流式转录中...

# summarizing.ellipsis
source: Summarizing...
de: Fasse zusammen...
ru: Суммаризация...
zh_hans: 总结中...

source: Completed
de: Abgeschlossen
ru: Завершено
zh_hans: 已完成

# error.arg1
source: Error: %@
de: Fehler: %@
ru: Ошибка: %@
zh_hans: 错误: %@

source: Live
zh_hans: 实时

source: Includes system audio
de: Inklusive Systemaudio
ru: Включая системный звук
zh_hans: 包含系统音频

source: Summary available
de: Zusammenfassung verfügbar
ru: Сводка доступна
zh_hans: 摘要可用

source: Transcription available
de: Transkription verfügbar
ru: Транскрипция доступна
zh_hans: 转录可用

# tags.arg1
source: Tags: %@
ru: Теги: %@
zh_hans: 标签: %@

source: Error: Empty transcription received. Please try again with a different model or check your audio quality.
de: Fehler: Leere Transkription empfangen. Bitte versuchen Sie es mit einem anderen Modell oder überprüfen Sie Ihre Audioqualität.
ru: Ошибка: Получена пустая транскрипция. Попробуйте другую модель или проверьте качество звука.
zh_hans: 错误：收到空转录。请尝试使用不同的模型或检查您的音频质量。

source: Speech to Text
de: Sprache zu Text
ru: Речь в текст
zh_hans: 语音转文本

source: Language
de: Sprache
ru: Язык
zh_hans: 语言

source: Refresh languages list
de: Sprachliste aktualisieren
ru: Обновить список языков
zh_hans: 刷新语言列表

source: Model
de: Modell
ru: Модель
zh_hans: 模型

source: Refresh models list
de: Modellliste aktualisieren
ru: Обновить список моделей
zh_hans: 刷新模型列表

# loading.models.ellipsis
source: Loading models...
de: Lade Modelle...
ru: Загрузка моделей...
zh_hans: 正在加载模型...

source: Whisper Model
de: Whisper Modell
ru: Модель Whisper
zh_hans: Whisper 模型

source: Specify the Whisper model to use for transcription. You can select from the list, refresh to load from server, or choose 'Custom...' to enter manually.
de: Geben Sie das Whisper-Modell für die Transkription an. Sie können aus der Liste wählen, vom Server laden oder 'Benutzerdefiniert...' wählen, um es manuell einzugeben.
ru: Укажите модель Whisper для транскрипции. Выберите из списка, обновите с сервера или выберите 'Другая...', чтобы ввести вручную.
zh_hans: 指定用于转录的 Whisper 模型。您可以从列表中选择，刷新以从服务器加载，或选择“自定义...”手动输入。

source: Whisper compatible API base URL
de: Whisper-kompatible API Basis-URL
ru: Базовый URL Whisper-совместимого API
zh_hans: Whisper 兼容 API 基础 URL

source: e.g., https://api.openai.com/v1/ or your local Whisper instance base URL. Endpoint will be appended automatically.
de: z.B. https://api.openai.com/v1/ oder Ihre lokale Whisper-Instanz Basis-URL. Endpunkt wird automatisch angehängt.
ru: например, https://api.openai.com/v1/ или URL вашего локального Whisper. Эндпоинт будет добавлен автоматически.
zh_hans: 例如，https://api.openai.com/v1/ 或您的本地 Whisper 实例基础 URL。端点将自动附加。

source: Whisper API Key
de: Whisper API Schlüssel
ru: API ключ Whisper
zh_hans: Whisper API 密钥

source: Your Whisper API key. Leave empty for local servers that don't require authentication.
de: Ihr Whisper API Schlüssel. Leer lassen für lokale Server, die keine Authentifizierung benötigen.
ru: Ваш API ключ Whisper. Оставьте пустым для локальных серверов без аутентификации.
zh_hans: 您的 Whisper API 密钥。对于不需要身份验证的本地服务器，请留空。

source: Whisper compatible API
de: Whisper-kompatible API
ru: Whisper-совместимый API
zh_hans: Whisper 兼容 API

source: Native
de: Nativ
ru: Нативный
zh_hans: 原生

source: OpenAI compatible API base URL
de: OpenAI-kompatible API Basis-URL
ru: Базовый URL OpenAI-совместимого API
zh_hans: OpenAI 兼容 API 基础 URL

# openai.base.url.caption
source: e.g., https://api.openai.com/v1/ or your custom summarization endpoint base URL. Endpoint will be appended automatically.
de: z.B. https://api.openai.com/v1/ oder Ihre benutzerdefinierte Zusammenfassungs-Endpunkt Basis-URL. Endpunkt wird automatisch angehängt.
ru: например, https://api.openai.com/v1/ или URL вашего кастомного эндпоинта. Эндпоинт будет добавлен автоматически.
zh_hans: 例如，https://api.openai.com/v1/ 或您的自定义摘要端点基础 URL。端点将自动附加。

source: OpenAI API Key
de: OpenAI API Schlüssel
ru: API ключ OpenAI
zh_hans: OpenAI API 密钥

source: Your OpenAI API key. Leave empty for local servers that don't require authentication.
de: Ihr OpenAI API Schlüssel. Leer lassen für lokale Server, die keine Authentifizierung benötigen.
ru: Ваш API ключ OpenAI. Оставьте пустым для локальных серверов без аутентификации.
zh_hans: 您的 OpenAI API 密钥。对于不需要身份验证的本地服务器，请留空。

source: OpenAI Model
de: OpenAI Modell
ru: Модель OpenAI
zh_hans: OpenAI 模型

source: App Language
de: App-Sprache
ru: Язык приложения
zh_hans: 应用语言

# app.language.system
source: System default
de: Systemstandard
ru: Системный
zh_hans: 系统默认

# app.language.caption
source: Choose a language for the interface or keep the system language. Restart required.
de: Wählen Sie eine Sprache für die Benutzeroberfläche oder behalten Sie die Systemsprache bei. Neustart erforderlich.
ru: Выберите язык интерфейса или оставьте системный. Требуется перезапуск.
zh_hans: 选择界面语言或保持系统语言。需要重启。

# app.language.restart.required
source: Restart Required
de: Neustart erforderlich
ru: Требуется перезапуск
zh_hans: 需要重启

# app.language.restart.required.message
source: The app needs to be restarted for the language change to take effect.
de: Die App muss neu gestartet werden, damit die Sprachänderung wirksam wird.
ru: Для вступления изменений в силу необходимо перезапустить приложение.
zh_hans: 应用需要重启以使语言更改生效。

source: Restart Now
de: Jetzt neu starten
ru: Перезапустить сейчас
zh_hans: 立即重启

source: Restart Later
de: Später neu starten
ru: Перезапустить позже
zh_hans: 稍后重启

source: Enter model name or refresh list
de: Modellnamen eingeben oder Liste aktualisieren
ru: Введите имя модели или обновите список
zh_hans: 输入模型名称或刷新列表

source: Select model
de: Modell auswählen
ru: Выберите модель
zh_hans: 选择模型

source: Select Whisper model
de: Whisper Modell auswählen
ru: Выберите модель Whisper
zh_hans: 选择 Whisper 模型

source: Select LLM model
de: LLM Modell auswählen
ru: Выберите модель LLM
zh_hans: 选择 LLM 模型

source: Specify the model to use for summarization. You can select from the list, refresh to load from server, or choose 'Custom...' to enter manually.
de: Geben Sie das Modell für die Zusammenfassung an. Sie können aus der Liste wählen, vom Server laden oder 'Benutzerdefiniert...' wählen, um es manuell einzugeben.
ru: Укажите модель для суммаризации. Выберите из списка, обновите с сервера или выберите 'Другая...', чтобы ввести вручную.
zh_hans: 指定用于总结的模型。您可以从列表中选择，刷新以从服务器加载，或选择“自定义...”手动输入。

source: Prompt
ru: Промпт
zh_hans: 提示词

source: Use {transcription} as a placeholder for the individual chunk text.
de: Verwenden Sie {transcription} als Platzhalter für den individuellen Textabschnitt.
ru: Используйте {transcription} как плейсхолдер для текста фрагмента.
zh_hans: 使用 {transcription} 作为单个块文本的占位符。

source: Generate short title after summarization
de: Kurzen Titel nach Zusammenfassung generieren
ru: Генерировать короткий заголовок после суммаризации
zh_hans: 总结后生成短标题

source: When enabled, the app asks the language model for a concise title based on the final summary.
de: Wenn aktiviert, fragt die App das Sprachmodell nach einem prägnanten Titel basierend auf der finalen Zusammenfassung.
ru: Если включено, приложение запрашивает у языковой модели краткий заголовок на основе итоговой сводки.
zh_hans: 启用后，应用会根据最终摘要要求语言模型提供简洁的标题。

source: Title generation prompt
de: Titelgenerierungs-Prompt
ru: Промпт для генерации заголовка
zh_hans: 标题生成提示词

source: Use {summary} as a placeholder for the completed summary text. The model should answer with a title only.
de: Verwenden Sie {summary} als Platzhalter für den fertigen Zusammenfassungstext. Das Modell sollte nur mit einem Titel antworten.
ru: Используйте {summary} как плейсхолдер для готового текста сводки. Модель должна вернуть только заголовок.
zh_hans: 使用 {summary} 作为已完成摘要文本的占位符。模型应仅回答标题。

source: Split long texts into chunks
de: Lange Texte in Abschnitte unterteilen
ru: Разбивать длинные тексты на части
zh_hans: 将长文本拆分为块

source: When enabled, long texts are split into smaller chunks before processing.
de: Wenn aktiviert, werden lange Texte vor der Verarbeitung in kleinere Abschnitte unterteilt.
ru: Если включено, длинные тексты разбиваются на небольшие фрагменты перед обработкой.
zh_hans: 启用后，长文本在处理前会被拆分为较小的块。

source: Final summary prompt
de: Finaler Zusammenfassungs-Prompt
ru: Промпт для итоговой сводки
zh_hans: 最终摘要提示词

source: Use {transcription} as a placeholder for the text to be processed.
de: Verwenden Sie {transcription} als Platzhalter für den zu verarbeitenden Text.
ru: Используйте {transcription} как плейсхолдер для обрабатываемого текста.
zh_hans: 使用 {transcription} 作为要处理文本的占位符。

source: Chunk Size (characters)
de: Abschnittsgröße (Zeichen)
ru: Размер фрагмента (символы)
zh_hans: 块大小（字符）

source: Maximum size for each text chunk in characters. Text is split intelligently by paragraphs first, then sentences, then words.
de: Maximale Größe für jeden Textabschnitt in Zeichen. Text wird intelligent zuerst nach Absätzen, dann Sätzen, dann Wörtern geteilt.
ru: Максимальный размер каждого фрагмента текста в символах. Текст разбивается умно: сначала по абзацам, затем по предложениям, затем по словам.
zh_hans: 每个文本块的最大字符数。文本将智能地按段落、句子、单词顺序拆分。

source: Simulate empty recordings list
de: Leere Aufnahmeliste simulieren
ru: Симулировать пустой список записей
zh_hans: 模拟空录音列表

source: Hides all recordings so you can preview the empty state. Available in Debug builds only.
de: Verbirgt alle Aufnahmen, damit Sie den leeren Zustand sehen können. Nur in Debug-Builds verfügbar.
ru: Скрывает все записи, чтобы можно было просмотреть пустое состояние. Доступно только в Debug сборках.
zh_hans: 隐藏所有录音以便预览空状态。仅在调试版本中可用。

source: Admin Tools
ru: Инструменты администратора
zh_hans: 管理工具

source: Native transcription language selection requires the Speech framework.
de: Die Auswahl der nativen Transkriptionssprache erfordert das Speech-Framework.
ru: Выбор языка нативной транскрипции требует Speech framework.
zh_hans: 原生转录语言选择需要 Speech 框架。

source: Invalid URL format
de: Ungültiges URL-Format
ru: Неверный формат URL
zh_hans: 无效的 URL 格式

source: Base URL is required
de: Basis-URL ist erforderlich
ru: Требуется базовый URL
zh_hans: 需要基础 URL

source: Invalid base URL format
de: Ungültiges Basis-URL-Format
ru: Неверный формат базового URL
zh_hans: 无效的基础 URL 格式

source: Invalid API URL
de: Ungültige API-URL
ru: Неверный URL API
zh_hans: 无效的 API URL

source: Invalid server response
de: Ungültige Serverantwort
ru: Неверный ответ сервера
zh_hans: 无效的服务器响应

# http.error.arg1
source: HTTP error: %d
de: HTTP-Fehler: %d
ru: Ошибка HTTP: %d
zh_hans: HTTP 错误: %d

source: No data received from server
de: Keine Daten vom Server empfangen
ru: Данные от сервера не получены
zh_hans: 未从服务器接收到数据

source: Unexpected response format
de: Unerwartetes Antwortformat
ru: Неожиданный формат ответа
zh_hans: 意外的响应格式

source: No speech languages available. Install Dictation assets in System Settings.
de: Keine Sprachsprachen verfügbar. Installieren Sie Diktier-Assets in den Systemeinstellungen.
ru: Нет доступных языков речи. Установите ресурсы диктовки в Системных настройках.
zh_hans: 无可用语音语言。请在系统设置中安装听写资源。

source: Requires macOS 26 or newer.
de: Erfordert macOS 26 oder neuer.
ru: Требуется macOS 26 или новее.
zh_hans: 需要 macOS 26 或更高版本。

source: Record not found. It may have been deleted.
de: Aufnahme nicht gefunden. Sie wurde möglicherweise gelöscht.
ru: Запись не найдена. Возможно, она была удалена.
zh_hans: 未找到记录。可能已被删除。

source: Audio file not found on disk.
de: Audiodatei nicht auf der Festplatte gefunden.
ru: Аудиофайл не найден на диске.
zh_hans: 磁盘上未找到音频文件。

source: Transcription text is empty after processing.
de: Transkriptionstext ist nach der Verarbeitung leer.
ru: Текст транскрипции пуст после обработки.
zh_hans: 处理后转录文本为空。
