Repository: pfrankov/vibe-scribe
Catalog: VibeScribe/Resources/*.lproj/Localizable.strings
Languages: de, ru, zh_hans

source: Summary is empty.
de: Zusammenfassung ist leer.
ru: Сводка пуста.
zh_hans: 摘要为空。

# invalid.api.url.2
source: Invalid API URL.
de: Ungültige API-URL.
ru: Неверный URL API.
zh_hans: 无效的 API URL。

source: Unexpected response format from LLM server.
de: Unerwartetes Antwortformat vom LLM-Server.
ru: Неожиданный формат ответа от LLM сервера.
zh_hans: 来自 LLM 服务器的意外响应格式。

# http.error.from.llm.server.arg1
source: HTTP error from LLM server: %d
de: HTTP-Fehler vom LLM-Server: %d
ru: Ошибка HTTP от LLM сервера: %d
zh_hans: 来自 LLM 服务器的 HTTP 错误: %d

# error.summarizing.chunk.arg1.arg2
source: Error summarizing chunk %d: %@
de: Fehler beim Zusammenfassen von Abschnitt %d: %@
ru: Ошибка суммаризации фрагмента %d: %@
zh_hans: 总结块 %d 时出错: %@

source: Remote transcription fallback requires a configured Whisper endpoint.
de: Remote-Transkriptions-Fallback erfordert einen konfigurierten Whisper-Endpunkt.
ru: Для удаленной транскрипции требуется настроенный эндпоинт Whisper.
zh_hans: 远程转录回退需要配置 Whisper 端点。

# whisper.endpoint.arg1.is.not.a.valid.base.url
source: Whisper endpoint %@ is not a valid base URL.
de: Whisper-Endpunkt %@ ist keine gültige Basis-URL.
ru: Эндпоинт Whisper %@ не является валидным базовым URL.
zh_hans: Whisper 端点 %@ 不是有效的基础 URL。

source: Transcription text is required before summarizing.
de: Transkriptionstext ist vor der Zusammenfassung erforderlich.
ru: Для суммаризации требуется текст транскрипции.
zh_hans: 总结前需要转录文本。

source: Audio file is invalid or corrupted
de: Audiodatei ist ungültig oder beschädigt
ru: Аудиофайл недействителен или поврежден
zh_hans: 音频文件无效或已损坏

# network.error.arg1
source: Network error: %@
de: Netzwerkfehler: %@
ru: Ошибка сети: %@
zh_hans: 网络错误: %@

source: Invalid response from server
de: Ungültige Antwort vom Server
ru: Неверный ответ от сервера
zh_hans: 来自服务器的无效响应

# server.error.arg1
source: Server error: %@
de: Serverfehler: %@
ru: Ошибка сервера: %@
zh_hans: 服务器错误: %@

source: An unknown error occurred
de: Ein unbekannter Fehler ist aufgetreten
ru: Произошла неизвестная ошибка
zh_hans: 发生未知错误

# data.parsing.error.arg1
source: Data parsing error: %@
de: Datenverarbeitungsfehler: %@
ru: Ошибка разбора данных: %@
zh_hans: 数据解析错误: %@

source: Server doesn't support SSE streaming
de: Server unterstützt kein SSE-Streaming
ru: Сервер не поддерживает SSE стриминг
zh_hans: 服务器不支持 SSE 流式传输

# streaming.error.arg1
source: Streaming error: %@
de: Streaming-Fehler: %@
ru: Ошибка стриминга: %@
zh_hans: 流式传输错误: %@

source: Permission was denied
de: Zugriff wurde verweigert
ru: В доступе отказано
zh_hans: 权限被拒绝

source: Transcription engine is unavailable
de: Transkriptions-Engine ist nicht verfügbar
ru: Движок транскрипции недоступен
zh_hans: 转录引擎不可用

# processing.failed.arg1
source: Processing failed: %@
de: Verarbeitung fehlgeschlagen: %@
ru: Обработка не удалась: %@
zh_hans: 处理失败: %@

source: Transcription feature unavailable on this platform
de: Transkriptionsfunktion auf dieser Plattform nicht verfügbar
ru: Функция транскрипции недоступна на этой платформе
zh_hans: 此平台上转录功能不可用

source: Unable to configure audio reader.
de: Audio-Reader konnte nicht konfiguriert werden.
ru: Не удалось настроить чтение аудио.
zh_hans: 无法配置音频读取器。

source: Unable to configure audio writer.
de: Audio-Writer konnte nicht konfiguriert werden.
ru: Не удалось настроить запись аудио.
zh_hans: 无法配置音频写入器。

source: Failed to start audio reader.
de: Starten des Audio-Readers fehlgeschlagen.
ru: Не удалось запустить чтение аудио.
zh_hans: 启动音频读取器失败。

source: Failed to start audio writer.
de: Starten des Audio-Writers fehlgeschlagen.
ru: Не удалось запустить запись аудио.
zh_hans: 启动音频写入器失败。

source: Failed to append audio sample buffer.
de: Anhängen des Audio-Sample-Puffers fehlgeschlagen.
ru: Не удалось добавить буфер аудиосэмплов.
zh_hans: 附加音频样本缓冲区失败。

source: Audio conversion did not complete.
de: Audiokonvertierung wurde nicht abgeschlossen.
ru: Конвертация аудио не завершена.
zh_hans: 音频转换未完成。

# file.not.found.arg1
source: File not found: %@
de: Datei nicht gefunden: %@
ru: Файл не найден: %@
zh_hans: 文件未找到: %@

# unsupported.format.arg1
source: Unsupported format: %@
de: Nicht unterstütztes Format: %@
ru: Неподдерживаемый формат: %@
zh_hans: 不支持的格式: %@

# invalid.audio.file.arg1
source: Invalid audio file: %@
de: Ungültige Audiodatei: %@
ru: Неверный аудиофайл: %@
zh_hans: 无效的音频文件: %@

# conversion.failed.arg1
source: Conversion failed: %@
de: Konvertierung fehlgeschlagen: %@
ru: Конвертация не удалась: %@
zh_hans: 转换失败: %@

# save.failed.arg1
source: Save failed: %@
de: Speichern fehlgeschlagen: %@
ru: Сохранение не удалось: %@
zh_hans: 保存失败: %@

# track.loading.failed.arg1
source: Track loading failed: %@
de: Laden des Tracks fehlgeschlagen: %@
ru: Загрузка трека не удалась: %@
zh_hans: 轨道加载失败: %@

# composition.failed.arg1
source: Composition failed: %@
de: Komposition fehlgeschlagen: %@
ru: Композиция не удалась: %@
zh_hans: 合成失败: %@

# export.failed.arg1
source: Export failed: %@
de: Export fehlgeschlagen: %@
ru: Экспорт не удался: %@
zh_hans: 导出失败: %@

source: Export was cancelled
de: Export wurde abgebrochen
ru: Экспорт был отменен
zh_hans: 导出已取消

source: Warning
de: Warnung
ru: Предупреждение
zh_hans: 警告

source: Info
ru: Информация
zh_hans: 信息

# custom.ellipsis
source: Custom...
de: Benutzerdefiniert...
ru: Другая...
zh_hans: 自定义...

source: Enter custom value
de: Benutzerdefinierten Wert eingeben
ru: Введите свое значение
zh_hans: 输入自定义值

# enter.value.ellipsis
source: Enter value...
de: Wert eingeben...
ru: Введите значение...
zh_hans: 输入值...
